Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_mdf.h
// DFLT0CR Configuration

#define	MDF_DFLT0CR_DFLTACTIVE	(0x1u<<31)
#define	MDF_DFLT0CR_DFLTRUN		(0x1u<<30)
#define	MDF_DFLT0CR_NBDIS		(0xFFu<<20)
#define	MDF_DFLT0CR_NBDIS_0		(0x1u<<20)
#define	MDF_DFLT0CR_SNPSFMT		(0x1u<<16)
#define	MDF_DFLT0CR_TRGSRC		(0xFu<<12)
#define	MDF_DFLT0CR_TRGSRC_0	(0x1u<<12)
#define	MDF_DFLT0CR_TRGSENS		(0x1u<<8)
#define	MDF_DFLT0CR_ACQMOD		(0x7u<<4)
#define	MDF_DFLT0CR_ACQMOD_0	(0x1u<<4)
#define	MDF_DFLT0CR_FTH			(0x1u<<2)
#define	MDF_DFLT0CR_DMAEN		(0x1u<<1)
#define	MDF_DFLT0CR_DFLTEN		(0x1u<<0)

// DFLT0CICR Configuration

#define	MDF_DFLT0CICR_SCALE		(0x3Fu<<20)
#define	MDF_DFLT0CICR_SCALE_0	(0x1u<<20)
#define	MDF_DFLT0CICR_MCICD		(0x1FFu<<8)
#define	MDF_DFLT0CICR_MCICD_0	(0x1u<<8)
#define	MDF_DFLT0CICR_CICMOD	(0x7u<<4)
#define	MDF_DFLT0CICR_CICMOD_0	(0x1u<<4)
#define	MDF_DFLT0CICR_DATSRC	(0x3u<<0)
#define	MDF_DFLT0CICR_DATSRC_0	(0x1u<<0)

// DFLT0RSFR Configuration

#define	MDF_DFLT0RSFR_HPFC		(0x3u<<8)
#define	MDF_DFLT0RSFR_HPFC_0	(0x1u<<8)
#define	MDF_DFLT0RSFR_HPFBYP	(0x1u<<7)
#define	MDF_DFLT0RSFR_RSFLTD	(0x1u<<4)
#define	MDF_DFLT0RSFR_RSFLTBYP	(0x1u<<0)

// DFLT0INTR Configuration

#define	MDF_DFLT0INTR_INTVAL	(0x7Fu<<4)
#define	MDF_DFLT0INTR_INTVAL_0	(0x1u<<4)
#define	MDF_DFLT0INTR_INTDIV	(0x3u<<0)
#define	MDF_DFLT0INTR_INTDIV_0	(0x1u<<0)

// OLD0CR Configuration

#define	MDF_OLD0CR_OLDACTIVE	(0x1u<<31)
#define	MDF_OLD0CR_ACICD		(0x1Fu<<17)
#define	MDF_OLD0CR_ACICD_0		(0x1u<<17)
#define	MDF_OLD0CR_ACICN		(0x3u<<12)
#define	MDF_OLD0CR_ACICN_0		(0x1u<<12)
#define	MDF_OLD0CR_BKOLD		(0xFu<<4)
#define	MDF_OLD0CR_BKOLD_0		(0x1u<<4)
#define	MDF_OLD0CR_THINB		(0x1u<<1)
#define	MDF_OLD0CR_OLDEN		(0x1u<<0)

// OLD0THLR Configuration

#define	MDF_OLD0THLR_OLDTHL		(0x3FFFFFFu<<0)
#define	MDF_OLD0THLR_OLDTHL_0	(0x1u<<0)

// OLD0THHR Configuration

#define	MDF_OLD0THHR_OLDTHH		(0x3FFFFFFu<<0)
#define	MDF_OLD0THHR_OLDTHH_0	(0x1u<<0)

// DLY0CR Configuration

#define	MDF_DLY0CR_SKPBF		(0x1u<<31)
#define	MDF_DLY0CR_SKPDLY		(0x7Fu<<0)
#define	MDF_DLY0CR_SKPDLY_0		(0x1u<<0)

// SCD0CR Configuration

#define	MDF_SCD0CR_SCDACTIVE	(0x1u<<31)
#define	MDF_SCD0CR_SCDT			(0xFFu<<12)
#define	MDF_SCD0CR_SCDT_0		(0x1u<<12)
#define	MDF_SCD0CR_BKSCD		(0xFu<<4)
#define	MDF_SCD0CR_BKSCD_0		(0x1u<<4)
#define	MDF_SCD0CR_SCDEN		(0x1u<<0)

// DFLT0IER Configuration

#define	MDF_DFLT0IER_RFOVRIE	(0x1u<<11)
#define	MDF_DFLT0IER_CKABIE		(0x1u<<10)
#define	MDF_DFLT0IER_SATIE		(0x1u<<9)
#define	MDF_DFLT0IER_SCDIE		(0x1u<<8)
#define	MDF_DFLT0IER_SSOVRIE	(0x1u<<7)
#define	MDF_DFLT0IER_OLDIE		(0x1u<<4)
#define	MDF_DFLT0IER_SSDRIE		(0x1u<<2)
#define	MDF_DFLT0IER_DOVRIE		(0x1u<<1)
#define	MDF_DFLT0IER_FTHIE		(0x1u<<0)

// DFLT0ISR Configuration

#define	MDF_DFLT0ISR_RFOVRF		(0x1u<<11)
#define	MDF_DFLT0ISR_CKABF		(0x1u<<10)
#define	MDF_DFLT0ISR_SATF		(0x1u<<9)
#define	MDF_DFLT0ISR_SCDF		(0x1u<<8)
#define	MDF_DFLT0ISR_SSOVRF		(0x1u<<7)
#define	MDF_DFLT0ISR_THHF		(0x1u<<6)
#define	MDF_DFLT0ISR_THLF		(0x1u<<5)
#define	MDF_DFLT0ISR_OLDF		(0x1u<<4)
#define	MDF_DFLT0ISR_RXNEF		(0x1u<<3)
#define	MDF_DFLT0ISR_SSDRF		(0x1u<<2)
#define	MDF_DFLT0ISR_DOVRF		(0x1u<<1)
#define	MDF_DFLT0ISR_FTHF		(0x1u<<0)

// OEC0CR Configuration

#define	MDF_OEC0CR_OFFSET		(0x3FFFFFFu<<0)
#define	MDF_OEC0CR_OFFSET_0		(0x1u<<0)

// SNPS0DR Configuration

#define	MDF_SNPS0DR_SDR			(0xFFFFu<<16)
#define	MDF_SNPS0DR_SDR_0		(0x1u<<16)
#define	MDF_SNPS0DR_EXTSDR		(0x7Fu<<9)
#define	MDF_SNPS0DR_EXTSDR_0	(0x1u<<9)
#define	MDF_SNPS0DR_MCICDC		(0x1FFu<<0)
#define	MDF_SNPS0DR_MCICDC_0	(0x1u<<0)

// DFLT0DR Configuration

#define	MDF_DFLT0DR_DR			(0xFFFFFFu<<8)
#define	MDF_DFLT0DR_DR_0		(0x1u<<8)

// SITF1CR Configuration

#define	MDF_SITF1CR_SITFACTIVE	(0x1u<<31)
#define	MDF_SITF1CR_STH			(0x1Fu<<8)
#define	MDF_SITF1CR_STH_0		(0x1u<<8)
#define	MDF_SITF1CR_SITFMOD		(0x3u<<4)
#define	MDF_SITF1CR_SITFMOD_0	(0x1u<<4)
#define	MDF_SITF1CR_SCKSRC		(0x3u<<1)
#define	MDF_SITF1CR_SCKSRC_0	(0x1u<<1)
#define	MDF_SITF1CR_SITFEN		(0x1u<<0)

// BSMX1CR Configuration

#define	MDF_BSMX1CR_BSMXACTIVE	(0x1u<<31)
#define	MDF_BSMX1CR_BSSEL		(0x1Fu<<0)
#define	MDF_BSMX1CR_BSSEL_0		(0x1u<<0)

// DFLT1CR Configuration

#define	MDF_DFLT1CR_DFLTACTIVE	(0x1u<<31)
#define	MDF_DFLT1CR_DFLTRUN		(0x1u<<30)
#define	MDF_DFLT1CR_NBDIS		(0xFFu<<20)
#define	MDF_DFLT1CR_NBDIS_0		(0x1u<<20)
#define	MDF_DFLT1CR_SNPSFMT		(0x1u<<16)
#define	MDF_DFLT1CR_TRGSRC		(0xFu<<12)
#define	MDF_DFLT1CR_TRGSRC_0	(0x1u<<12)
#define	MDF_DFLT1CR_TRGSENS		(0x1u<<8)
#define	MDF_DFLT1CR_ACQMOD		(0x7u<<4)
#define	MDF_DFLT1CR_ACQMOD_0	(0x1u<<4)
#define	MDF_DFLT1CR_FTH			(0x1u<<2)
#define	MDF_DFLT1CR_DMAEN		(0x1u<<1)
#define	MDF_DFLT1CR_DFLTEN		(0x1u<<0)

// DFLT1CICR Configuration

#define	MDF_DFLT1CICR_SCALE		(0x3Fu<<20)
#define	MDF_DFLT1CICR_SCALE_0	(0x1u<<20)
#define	MDF_DFLT1CICR_MCICD		(0x1FFu<<8)
#define	MDF_DFLT1CICR_MCICD_0	(0x1u<<8)
#define	MDF_DFLT1CICR_CICMOD	(0x7u<<4)
#define	MDF_DFLT1CICR_CICMOD_0	(0x1u<<4)
#define	MDF_DFLT1CICR_DATSRC	(0x3u<<0)
#define	MDF_DFLT1CICR_DATSRC_0	(0x1u<<0)

// DFLT1RSFR Configuration

#define	MDF_DFLT1RSFR_HPFC		(0x3u<<8)
#define	MDF_DFLT1RSFR_HPFC_0	(0x1u<<8)
#define	MDF_DFLT1RSFR_HPFBYP	(0x1u<<7)
#define	MDF_DFLT1RSFR_RSFLTD	(0x1u<<4)
#define	MDF_DFLT1RSFR_RSFLTBYP	(0x1u<<0)

// DFLT1INTR Configuration

#define	MDF_DFLT1INTR_INTVAL	(0x7Fu<<4)
#define	MDF_DFLT1INTR_INTVAL_0	(0x1u<<4)
#define	MDF_DFLT1INTR_INTDIV	(0x3u<<0)
#define	MDF_DFLT1INTR_INTDIV_0	(0x1u<<0)

// OLD1CR Configuration

#define	MDF_OLD1CR_OLDACTIVE	(0x1u<<31)
#define	MDF_OLD1CR_ACICD		(0x1Fu<<17)
#define	MDF_OLD1CR_ACICD_0		(0x1u<<17)
#define	MDF_OLD1CR_ACICN		(0x3u<<12)
#define	MDF_OLD1CR_ACICN_0		(0x1u<<12)
#define	MDF_OLD1CR_BKOLD		(0xFu<<4)
#define	MDF_OLD1CR_BKOLD_0		(0x1u<<4)
#define	MDF_OLD1CR_THINB		(0x1u<<1)
#define	MDF_OLD1CR_OLDEN		(0x1u<<0)

// OLD1THLR Configuration

#define	MDF_OLD1THLR_OLDTHL		(0x3FFFFFFu<<0)
#define	MDF_OLD1THLR_OLDTHL_0	(0x1u<<0)

// OLD1THHR Configuration

#define	MDF_OLD1THHR_OLDTHH		(0x3FFFFFFu<<0)
#define	MDF_OLD1THHR_OLDTHH_0	(0x1u<<0)

// DLY1CR Configuration

#define	MDF_DLY1CR_SKPBF		(0x1u<<31)
#define	MDF_DLY1CR_SKPDLY		(0x7Fu<<0)
#define	MDF_DLY1CR_SKPDLY_0		(0x1u<<0)

// SCD1CR Configuration

