Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_mdf.h
#define	MDF_SCD1CR_SCDACTIVE	(0x1u<<31)
#define	MDF_SCD1CR_SCDT			(0xFFu<<12)
#define	MDF_SCD1CR_SCDT_0		(0x1u<<12)
#define	MDF_SCD1CR_BKSCD		(0xFu<<4)
#define	MDF_SCD1CR_BKSCD_0		(0x1u<<4)
#define	MDF_SCD1CR_SCDEN		(0x1u<<0)

// DFLT1IER Configuration

#define	MDF_DFLT1IER_RFOVRIE	(0x1u<<11)
#define	MDF_DFLT1IER_CKABIE		(0x1u<<10)
#define	MDF_DFLT1IER_SATIE		(0x1u<<9)
#define	MDF_DFLT1IER_SCDIE		(0x1u<<8)
#define	MDF_DFLT1IER_SSOVRIE	(0x1u<<7)
#define	MDF_DFLT1IER_OLDIE		(0x1u<<4)
#define	MDF_DFLT1IER_SSDRIE		(0x1u<<2)
#define	MDF_DFLT1IER_DOVRIE		(0x1u<<1)
#define	MDF_DFLT1IER_FTHIE		(0x1u<<0)

// DFLT1ISR Configuration

#define	MDF_DFLT1ISR_RFOVRF		(0x1u<<11)
#define	MDF_DFLT1ISR_CKABF		(0x1u<<10)
#define	MDF_DFLT1ISR_SATF		(0x1u<<9)
#define	MDF_DFLT1ISR_SCDF		(0x1u<<8)
#define	MDF_DFLT1ISR_SSOVRF		(0x1u<<7)
#define	MDF_DFLT1ISR_THHF		(0x1u<<6)
#define	MDF_DFLT1ISR_THLF		(0x1u<<5)
#define	MDF_DFLT1ISR_OLDF		(0x1u<<4)
#define	MDF_DFLT1ISR_RXNEF		(0x1u<<3)
#define	MDF_DFLT1ISR_SSDRF		(0x1u<<2)
#define	MDF_DFLT1ISR_DOVRF		(0x1u<<1)
#define	MDF_DFLT1ISR_FTHF		(0x1u<<0)

// OEC1CR Configuration

#define	MDF_OEC1CR_OFFSET		(0x3FFFFFFu<<0)
#define	MDF_OEC1CR_OFFSET_0		(0x1u<<0)

// SNPS1DR Configuration

#define	MDF_SNPS1DR_SDR			(0xFFFFu<<16)
#define	MDF_SNPS1DR_SDR_0		(0x1u<<16)
#define	MDF_SNPS1DR_EXTSDR		(0x7Fu<<9)
#define	MDF_SNPS1DR_EXTSDR_0	(0x1u<<9)
#define	MDF_SNPS1DR_MCICDC		(0x1FFu<<0)
#define	MDF_SNPS1DR_MCICDC_0	(0x1u<<0)

// DFLT1DR Configuration

#define	MDF_DFLT1DR_DR			(0xFFFFFFu<<8)
#define	MDF_DFLT1DR_DR_0		(0x1u<<8)

// SITF2CR Configuration

#define	MDF_SITF2CR_SITFACTIVE	(0x1u<<31)
#define	MDF_SITF2CR_STH			(0x1Fu<<8)
#define	MDF_SITF2CR_STH_0		(0x1u<<8)
#define	MDF_SITF2CR_SITFMOD		(0x3u<<4)
#define	MDF_SITF2CR_SITFMOD_0	(0x1u<<4)
#define	MDF_SITF2CR_SCKSRC		(0x3u<<1)
#define	MDF_SITF2CR_SCKSRC_0	(0x1u<<1)
#define	MDF_SITF2CR_SITFEN		(0x1u<<0)

// BSMX2CR Configuration

#define	MDF_BSMX2CR_BSMXACTIVE	(0x1u<<31)
#define	MDF_BSMX2CR_BSSEL		(0x1Fu<<0)
#define	MDF_BSMX2CR_BSSEL_0		(0x1u<<0)

// DFLT2CR Configuration

#define	MDF_DFLT2CR_DFLTACTIVE	(0x1u<<31)
#define	MDF_DFLT2CR_DFLTRUN		(0x1u<<30)
#define	MDF_DFLT2CR_NBDIS		(0xFFu<<20)
#define	MDF_DFLT2CR_NBDIS_0		(0x1u<<20)
#define	MDF_DFLT2CR_SNPSFMT		(0x1u<<16)
#define	MDF_DFLT2CR_TRGSRC		(0xFu<<12)
#define	MDF_DFLT2CR_TRGSRC_0	(0x1u<<12)
#define	MDF_DFLT2CR_TRGSENS		(0x1u<<8)
#define	MDF_DFLT2CR_ACQMOD		(0x7u<<4)
#define	MDF_DFLT2CR_ACQMOD_0	(0x1u<<4)
#define	MDF_DFLT2CR_FTH			(0x1u<<2)
#define	MDF_DFLT2CR_DMAEN		(0x1u<<1)
#define	MDF_DFLT2CR_DFLTEN		(0x1u<<0)

// DFLT2CICR Configuration

#define	MDF_DFLT2CICR_SCALE		(0x3Fu<<20)
#define	MDF_DFLT2CICR_SCALE_0	(0x1u<<20)
#define	MDF_DFLT2CICR_MCICD		(0x1FFu<<8)
#define	MDF_DFLT2CICR_MCICD_0	(0x1u<<8)
#define	MDF_DFLT2CICR_CICMOD	(0x7u<<4)
#define	MDF_DFLT2CICR_CICMOD_0	(0x1u<<4)
#define	MDF_DFLT2CICR_DATSRC	(0x3u<<0)
#define	MDF_DFLT2CICR_DATSRC_0	(0x1u<<0)

// DFLT2RSFR Configuration

#define	MDF_DFLT2RSFR_HPFC		(0x3u<<8)
#define	MDF_DFLT2RSFR_HPFC_0	(0x1u<<8)
#define	MDF_DFLT2RSFR_HPFBYP	(0x1u<<7)
#define	MDF_DFLT2RSFR_RSFLTD	(0x1u<<4)
#define	MDF_DFLT2RSFR_RSFLTBYP	(0x1u<<0)

// DFLT2INTR Configuration

#define	MDF_DFLT2INTR_INTVAL	(0x7Fu<<4)
#define	MDF_DFLT2INTR_INTVAL_0	(0x1u<<4)
#define	MDF_DFLT2INTR_INTDIV	(0x3u<<0)
#define	MDF_DFLT2INTR_INTDIV_0	(0x1u<<0)

// OLD2CR Configuration

#define	MDF_OLD2CR_OLDACTIVE	(0x1u<<31)
#define	MDF_OLD2CR_ACICD		(0x1Fu<<17)
#define	MDF_OLD2CR_ACICD_0		(0x1u<<17)
#define	MDF_OLD2CR_ACICN		(0x3u<<12)
#define	MDF_OLD2CR_ACICN_0		(0x1u<<12)
#define	MDF_OLD2CR_BKOLD		(0xFu<<4)
#define	MDF_OLD2CR_BKOLD_0		(0x1u<<4)
#define	MDF_OLD2CR_THINB		(0x1u<<1)
#define	MDF_OLD2CR_OLDEN		(0x1u<<0)

// OLD2THLR Configuration

#define	MDF_OLD2THLR_OLDTHL		(0x3FFFFFFu<<0)
#define	MDF_OLD2THLR_OLDTHL_0	(0x1u<<0)

// OLD2THHR Configuration

#define	MDF_OLD2THHR_OLDTHH		(0x3FFFFFFu<<0)
#define	MDF_OLD2THHR_OLDTHH_0	(0x1u<<0)

// DLY2CR Configuration

#define	MDF_DLY2CR_SKPBF		(0x1u<<31)
#define	MDF_DLY2CR_SKPDLY		(0x7Fu<<0)
#define	MDF_DLY2CR_SKPDLY_0		(0x1u<<0)

// SCD2CR Configuration

#define	MDF_SCD2CR_SCDACTIVE	(0x1u<<31)
#define	MDF_SCD2CR_SCDT			(0xFFu<<12)
#define	MDF_SCD2CR_SCDT_0		(0x1u<<12)
#define	MDF_SCD2CR_BKSCD		(0xFu<<4)
#define	MDF_SCD2CR_BKSCD_0		(0x1u<<4)
#define	MDF_SCD2CR_SCDEN		(0x1u<<0)

// DFLT2IER Configuration

#define	MDF_DFLT2IER_RFOVRIE	(0x1u<<11)
#define	MDF_DFLT2IER_CKABIE		(0x1u<<10)
#define	MDF_DFLT2IER_SATIE		(0x1u<<9)
#define	MDF_DFLT2IER_SCDIE		(0x1u<<8)
#define	MDF_DFLT2IER_SSOVRIE	(0x1u<<7)
#define	MDF_DFLT2IER_OLDIE		(0x1u<<4)
#define	MDF_DFLT2IER_SSDRIE		(0x1u<<2)
#define	MDF_DFLT2IER_DOVRIE		(0x1u<<1)
#define	MDF_DFLT2IER_FTHIE		(0x1u<<0)

// DFLT2ISR Configuration

#define	MDF_DFLT2ISR_RFOVRF		(0x1u<<11)
#define	MDF_DFLT2ISR_CKABF		(0x1u<<10)
#define	MDF_DFLT2ISR_SATF		(0x1u<<9)
#define	MDF_DFLT2ISR_SCDF		(0x1u<<8)
#define	MDF_DFLT2ISR_SSOVRF		(0x1u<<7)
#define	MDF_DFLT2ISR_THHF		(0x1u<<6)
#define	MDF_DFLT2ISR_THLF		(0x1u<<5)
#define	MDF_DFLT2ISR_OLDF		(0x1u<<4)
#define	MDF_DFLT2ISR_RXNEF		(0x1u<<3)
#define	MDF_DFLT2ISR_SSDRF		(0x1u<<2)
#define	MDF_DFLT2ISR_DOVRF		(0x1u<<1)
#define	MDF_DFLT2ISR_FTHF		(0x1u<<0)

// OEC2CR Configuration

#define	MDF_OEC2CR_OFFSET		(0x3FFFFFFu<<0)
#define	MDF_OEC2CR_OFFSET_0		(0x1u<<0)

// SNPS2DR Configuration

#define	MDF_SNPS2DR_SDR			(0xFFFFu<<16)
#define	MDF_SNPS2DR_SDR_0		(0x1u<<16)
#define	MDF_SNPS2DR_EXTSDR		(0x7Fu<<9)
#define	MDF_SNPS2DR_EXTSDR_0	(0x1u<<9)
#define	MDF_SNPS2DR_MCICDC		(0x1FFu<<0)
#define	MDF_SNPS2DR_MCICDC_0	(0x1u<<0)

// DFLT2DR Configuration

#define	MDF_DFLT2DR_DR			(0xFFFFFFu<<8)
#define	MDF_DFLT2DR_DR_0		(0x1u<<8)

// SITF3CR Configuration

#define	MDF_SITF3CR_SITFACTIVE	(0x1u<<31)
#define	MDF_SITF3CR_STH			(0x1Fu<<8)
#define	MDF_SITF3CR_STH_0		(0x1u<<8)
#define	MDF_SITF3CR_SITFMOD		(0x3u<<4)
#define	MDF_SITF3CR_SITFMOD_0	(0x1u<<4)
#define	MDF_SITF3CR_SCKSRC		(0x3u<<1)
#define	MDF_SITF3CR_SCKSRC_0	(0x1u<<1)
#define	MDF_SITF3CR_SITFEN		(0x1u<<0)

// BSMX3CR Configuration

#define	MDF_BSMX3CR_BSMXACTIVE	(0x1u<<31)
#define	MDF_BSMX3CR_BSSEL		(0x1Fu<<0)
#define	MDF_BSMX3CR_BSSEL_0		(0x1u<<0)

