Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_mdf.h
// DFLT3CR Configuration

#define	MDF_DFLT3CR_DFLTACTIVE	(0x1u<<31)
#define	MDF_DFLT3CR_DFLTRUN		(0x1u<<30)
#define	MDF_DFLT3CR_NBDIS		(0xFFu<<20)
#define	MDF_DFLT3CR_NBDIS_0		(0x1u<<20)
#define	MDF_DFLT3CR_SNPSFMT		(0x1u<<16)
#define	MDF_DFLT3CR_TRGSRC		(0xFu<<12)
#define	MDF_DFLT3CR_TRGSRC_0	(0x1u<<12)
#define	MDF_DFLT3CR_TRGSENS		(0x1u<<8)
#define	MDF_DFLT3CR_ACQMOD		(0x7u<<4)
#define	MDF_DFLT3CR_ACQMOD_0	(0x1u<<4)
#define	MDF_DFLT3CR_FTH			(0x1u<<2)
#define	MDF_DFLT3CR_DMAEN		(0x1u<<1)
#define	MDF_DFLT3CR_DFLTEN		(0x1u<<0)

// DFLT3CICR Configuration

#define	MDF_DFLT3CICR_SCALE		(0x3Fu<<20)
#define	MDF_DFLT3CICR_SCALE_0	(0x1u<<20)
#define	MDF_DFLT3CICR_MCICD		(0x1FFu<<8)
#define	MDF_DFLT3CICR_MCICD_0	(0x1u<<8)
#define	MDF_DFLT3CICR_CICMOD	(0x7u<<4)
#define	MDF_DFLT3CICR_CICMOD_0	(0x1u<<4)
#define	MDF_DFLT3CICR_DATSRC	(0x3u<<0)
#define	MDF_DFLT3CICR_DATSRC_0	(0x1u<<0)

// DFLT3RSFR Configuration

#define	MDF_DFLT3RSFR_HPFC		(0x3u<<8)
#define	MDF_DFLT3RSFR_HPFC_0	(0x1u<<8)
#define	MDF_DFLT3RSFR_HPFBYP	(0x1u<<7)
#define	MDF_DFLT3RSFR_RSFLTD	(0x1u<<4)
#define	MDF_DFLT3RSFR_RSFLTBYP	(0x1u<<0)

// DFLT3INTR Configuration

#define	MDF_DFLT3INTR_INTVAL	(0x7Fu<<4)
#define	MDF_DFLT3INTR_INTVAL_0	(0x1u<<4)
#define	MDF_DFLT3INTR_INTDIV	(0x3u<<0)
#define	MDF_DFLT3INTR_INTDIV_0	(0x1u<<0)

// OLD3CR Configuration

#define	MDF_OLD3CR_OLDACTIVE	(0x1u<<31)
#define	MDF_OLD3CR_ACICD		(0x1Fu<<17)
#define	MDF_OLD3CR_ACICD_0		(0x1u<<17)
#define	MDF_OLD3CR_ACICN		(0x3u<<12)
#define	MDF_OLD3CR_ACICN_0		(0x1u<<12)
#define	MDF_OLD3CR_BKOLD		(0xFu<<4)
#define	MDF_OLD3CR_BKOLD_0		(0x1u<<4)
#define	MDF_OLD3CR_THINB		(0x1u<<1)
#define	MDF_OLD3CR_OLDEN		(0x1u<<0)

// OLD3THLR Configuration

#define	MDF_OLD3THLR_OLDTHL		(0x3FFFFFFu<<0)
#define	MDF_OLD3THLR_OLDTHL_0	(0x1u<<0)

// OLD3THHR Configuration

#define	MDF_OLD3THHR_OLDTHH		(0x3FFFFFFu<<0)
#define	MDF_OLD3THHR_OLDTHH_0	(0x1u<<0)

// DLY3CR Configuration

#define	MDF_DLY3CR_SKPBF		(0x1u<<31)
#define	MDF_DLY3CR_SKPDLY		(0x7Fu<<0)
#define	MDF_DLY3CR_SKPDLY_0		(0x1u<<0)

// SCD3CR Configuration

#define	MDF_SCD3CR_SCDACTIVE	(0x1u<<31)
#define	MDF_SCD3CR_SCDT			(0xFFu<<12)
#define	MDF_SCD3CR_SCDT_0		(0x1u<<12)
#define	MDF_SCD3CR_BKSCD		(0xFu<<4)
#define	MDF_SCD3CR_BKSCD_0		(0x1u<<4)
#define	MDF_SCD3CR_SCDEN		(0x1u<<0)

// DFLT3IER Configuration

#define	MDF_DFLT3IER_RFOVRIE	(0x1u<<11)
#define	MDF_DFLT3IER_CKABIE		(0x1u<<10)
#define	MDF_DFLT3IER_SATIE		(0x1u<<9)
#define	MDF_DFLT3IER_SCDIE		(0x1u<<8)
#define	MDF_DFLT3IER_SSOVRIE	(0x1u<<7)
#define	MDF_DFLT3IER_OLDIE		(0x1u<<4)
#define	MDF_DFLT3IER_SSDRIE		(0x1u<<2)
#define	MDF_DFLT3IER_DOVRIE		(0x1u<<1)
#define	MDF_DFLT3IER_FTHIE		(0x1u<<0)

// DFLT3ISR Configuration

#define	MDF_DFLT3ISR_RFOVRF		(0x1u<<11)
#define	MDF_DFLT3ISR_CKABF		(0x1u<<10)
#define	MDF_DFLT3ISR_SATF		(0x1u<<9)
#define	MDF_DFLT3ISR_SCDF		(0x1u<<8)
#define	MDF_DFLT3ISR_SSOVRF		(0x1u<<7)
#define	MDF_DFLT3ISR_THHF		(0x1u<<6)
#define	MDF_DFLT3ISR_THLF		(0x1u<<5)
#define	MDF_DFLT3ISR_OLDF		(0x1u<<4)
#define	MDF_DFLT3ISR_RXNEF		(0x1u<<3)
#define	MDF_DFLT3ISR_SSDRF		(0x1u<<2)
#define	MDF_DFLT3ISR_DOVRF		(0x1u<<1)
#define	MDF_DFLT3ISR_FTHF		(0x1u<<0)

// OEC3CR Configuration

#define	MDF_OEC3CR_OFFSET		(0x3FFFFFFu<<0)
#define	MDF_OEC3CR_OFFSET_0		(0x1u<<0)

// SNPS3DR Configuration

#define	MDF_SNPS3DR_SDR			(0xFFFFu<<16)
#define	MDF_SNPS3DR_SDR_0		(0x1u<<16)
#define	MDF_SNPS3DR_EXTSDR		(0x7Fu<<9)
#define	MDF_SNPS3DR_EXTSDR_0	(0x1u<<9)
#define	MDF_SNPS3DR_MCICDC		(0x1FFu<<0)
#define	MDF_SNPS3DR_MCICDC_0	(0x1u<<0)

// DFLT3DR Configuration

#define	MDF_DFLT3DR_DR			(0xFFFFFFu<<8)
#define	MDF_DFLT3DR_DR_0		(0x1u<<8)

// SITF4CR Configuration

#define	MDF_SITF4CR_SITFACTIVE	(0x1u<<31)
#define	MDF_SITF4CR_STH			(0x1Fu<<8)
#define	MDF_SITF4CR_STH_0		(0x1u<<8)
#define	MDF_SITF4CR_SITFMOD		(0x3u<<4)
#define	MDF_SITF4CR_SITFMOD_0	(0x1u<<4)
#define	MDF_SITF4CR_SCKSRC		(0x3u<<1)
#define	MDF_SITF4CR_SCKSRC_0	(0x1u<<1)
#define	MDF_SITF4CR_SITFEN		(0x1u<<0)

// BSMX4CR Configuration

#define	MDF_BSMX4CR_BSMXACTIVE	(0x1u<<31)
#define	MDF_BSMX4CR_BSSEL		(0x1Fu<<0)
#define	MDF_BSMX4CR_BSSEL_0		(0x1u<<0)

// DFLT4CR Configuration

#define	MDF_DFLT4CR_DFLTACTIVE	(0x1u<<31)
#define	MDF_DFLT4CR_DFLTRUN		(0x1u<<30)
#define	MDF_DFLT4CR_NBDIS		(0xFFu<<20)
#define	MDF_DFLT4CR_NBDIS_0		(0x1u<<20)
#define	MDF_DFLT4CR_SNPSFMT		(0x1u<<16)
#define	MDF_DFLT4CR_TRGSRC		(0xFu<<12)
#define	MDF_DFLT4CR_TRGSRC_0	(0x1u<<12)
#define	MDF_DFLT4CR_TRGSENS		(0x1u<<8)
#define	MDF_DFLT4CR_ACQMOD		(0x7u<<4)
#define	MDF_DFLT4CR_ACQMOD_0	(0x1u<<4)
#define	MDF_DFLT4CR_FTH			(0x1u<<2)
#define	MDF_DFLT4CR_DMAEN		(0x1u<<1)
#define	MDF_DFLT4CR_DFLTEN		(0x1u<<0)

// DFLT4CICR Configuration

#define	MDF_DFLT4CICR_SCALE		(0x3Fu<<20)
#define	MDF_DFLT4CICR_SCALE_0	(0x1u<<20)
#define	MDF_DFLT4CICR_MCICD		(0x1FFu<<8)
#define	MDF_DFLT4CICR_MCICD_0	(0x1u<<8)
#define	MDF_DFLT4CICR_CICMOD	(0x7u<<4)
#define	MDF_DFLT4CICR_CICMOD_0	(0x1u<<4)
#define	MDF_DFLT4CICR_DATSRC	(0x3u<<0)
#define	MDF_DFLT4CICR_DATSRC_0	(0x1u<<0)

// DFLT4RSFR Configuration

#define	MDF_DFLT4RSFR_HPFC		(0x3u<<8)
#define	MDF_DFLT4RSFR_HPFC_0	(0x1u<<8)
#define	MDF_DFLT4RSFR_HPFBYP	(0x1u<<7)
#define	MDF_DFLT4RSFR_RSFLTD	(0x1u<<4)
#define	MDF_DFLT4RSFR_RSFLTBYP	(0x1u<<0)

// DFLT4INTR Configuration

#define	MDF_DFLT4INTR_INTVAL	(0x7Fu<<4)
#define	MDF_DFLT4INTR_INTVAL_0	(0x1u<<4)
#define	MDF_DFLT4INTR_INTDIV	(0x3u<<0)
#define	MDF_DFLT4INTR_INTDIV_0	(0x1u<<0)

// OLD4CR Configuration

#define	MDF_OLD4CR_OLDACTIVE	(0x1u<<31)
#define	MDF_OLD4CR_ACICD		(0x1Fu<<17)
#define	MDF_OLD4CR_ACICD_0		(0x1u<<17)
#define	MDF_OLD4CR_ACICN		(0x3u<<12)
#define	MDF_OLD4CR_ACICN_0		(0x1u<<12)
#define	MDF_OLD4CR_BKOLD		(0xFu<<4)
#define	MDF_OLD4CR_BKOLD_0		(0x1u<<4)
#define	MDF_OLD4CR_THINB		(0x1u<<1)
#define	MDF_OLD4CR_OLDEN		(0x1u<<0)

// OLD4THLR Configuration

#define	MDF_OLD4THLR_OLDTHL		(0x3FFFFFFu<<0)
#define	MDF_OLD4THLR_OLDTHL_0	(0x1u<<0)

// OLD4THHR Configuration

#define	MDF_OLD4THHR_OLDTHH		(0x3FFFFFFu<<0)
#define	MDF_OLD4THHR_OLDTHH_0	(0x1u<<0)

// DLY4CR Configuration

#define	MDF_DLY4CR_SKPBF		(0x1u<<31)
#define	MDF_DLY4CR_SKPDLY		(0x7Fu<<0)
#define	MDF_DLY4CR_SKPDLY_0		(0x1u<<0)

// SCD4CR Configuration

