Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_mdf.h
#define	MDF_SCD4CR_SCDACTIVE	(0x1u<<31)
#define	MDF_SCD4CR_SCDT			(0xFFu<<12)
#define	MDF_SCD4CR_SCDT_0		(0x1u<<12)
#define	MDF_SCD4CR_BKSCD		(0xFu<<4)
#define	MDF_SCD4CR_BKSCD_0		(0x1u<<4)
#define	MDF_SCD4CR_SCDEN		(0x1u<<0)

// DFLT4IER Configuration

#define	MDF_DFLT4IER_RFOVRIE	(0x1u<<11)
#define	MDF_DFLT4IER_CKABIE		(0x1u<<10)
#define	MDF_DFLT4IER_SATIE		(0x1u<<9)
#define	MDF_DFLT4IER_SCDIE		(0x1u<<8)
#define	MDF_DFLT4IER_SSOVRIE	(0x1u<<7)
#define	MDF_DFLT4IER_OLDIE		(0x1u<<4)
#define	MDF_DFLT4IER_SSDRIE		(0x1u<<2)
#define	MDF_DFLT4IER_DOVRIE		(0x1u<<1)
#define	MDF_DFLT4IER_FTHIE		(0x1u<<0)

// DFLT4ISR Configuration

#define	MDF_DFLT4ISR_RFOVRF		(0x1u<<11)
#define	MDF_DFLT4ISR_CKABF		(0x1u<<10)
#define	MDF_DFLT4ISR_SATF		(0x1u<<9)
#define	MDF_DFLT4ISR_SCDF		(0x1u<<8)
#define	MDF_DFLT4ISR_SSOVRF		(0x1u<<7)
#define	MDF_DFLT4ISR_THHF		(0x1u<<6)
#define	MDF_DFLT4ISR_THLF		(0x1u<<5)
#define	MDF_DFLT4ISR_OLDF		(0x1u<<4)
#define	MDF_DFLT4ISR_RXNEF		(0x1u<<3)
#define	MDF_DFLT4ISR_SSDRF		(0x1u<<2)
#define	MDF_DFLT4ISR_DOVRF		(0x1u<<1)
#define	MDF_DFLT4ISR_FTHF		(0x1u<<0)

// OEC4CR Configuration

#define	MDF_OEC4CR_OFFSET		(0x3FFFFFFu<<0)
#define	MDF_OEC4CR_OFFSET_0		(0x1u<<0)

// SNPS4DR Configuration

#define	MDF_SNPS4DR_SDR			(0xFFFFu<<16)
#define	MDF_SNPS4DR_SDR_0		(0x1u<<16)
#define	MDF_SNPS4DR_EXTSDR		(0x7Fu<<9)
#define	MDF_SNPS4DR_EXTSDR_0	(0x1u<<9)
#define	MDF_SNPS4DR_MCICDC		(0x1FFu<<0)
#define	MDF_SNPS4DR_MCICDC_0	(0x1u<<0)

// DFLT4DR Configuration

#define	MDF_DFLT4DR_DR			(0xFFFFFFu<<8)
#define	MDF_DFLT4DR_DR_0		(0x1u<<8)

// SITF5CR Configuration

#define	MDF_SITF5CR_SITFACTIVE	(0x1u<<31)
#define	MDF_SITF5CR_STH			(0x1Fu<<8)
#define	MDF_SITF5CR_STH_0		(0x1u<<8)
#define	MDF_SITF5CR_SITFMOD		(0x3u<<4)
#define	MDF_SITF5CR_SITFMOD_0	(0x1u<<4)
#define	MDF_SITF5CR_SCKSRC		(0x3u<<1)
#define	MDF_SITF5CR_SCKSRC_0	(0x1u<<1)
#define	MDF_SITF5CR_SITFEN		(0x1u<<0)

// BSMX5CR Configuration

#define	MDF_BSMX5CR_BSMXACTIVE	(0x1u<<31)
#define	MDF_BSMX5CR_BSSEL		(0x1Fu<<0)
#define	MDF_BSMX5CR_BSSEL_0		(0x1u<<0)

// DFLT5CR Configuration

#define	MDF_DFLT5CR_DFLTACTIVE	(0x1u<<31)
#define	MDF_DFLT5CR_DFLTRUN		(0x1u<<30)
#define	MDF_DFLT5CR_NBDIS		(0xFFu<<20)
#define	MDF_DFLT5CR_NBDIS_0		(0x1u<<20)
#define	MDF_DFLT5CR_SNPSFMT		(0x1u<<16)
#define	MDF_DFLT5CR_TRGSRC		(0xFu<<12)
#define	MDF_DFLT5CR_TRGSRC_0	(0x1u<<12)
#define	MDF_DFLT5CR_TRGSENS		(0x1u<<8)
#define	MDF_DFLT5CR_ACQMOD		(0x7u<<4)
#define	MDF_DFLT5CR_ACQMOD_0	(0x1u<<4)
#define	MDF_DFLT5CR_FTH			(0x1u<<2)
#define	MDF_DFLT5CR_DMAEN		(0x1u<<1)
#define	MDF_DFLT5CR_DFLTEN		(0x1u<<0)

// DFLT5CICR Configuration

#define	MDF_DFLT5CICR_SCALE		(0x3Fu<<20)
#define	MDF_DFLT5CICR_SCALE_0	(0x1u<<20)
#define	MDF_DFLT5CICR_MCICD		(0x1FFu<<8)
#define	MDF_DFLT5CICR_MCICD_0	(0x1u<<8)
#define	MDF_DFLT5CICR_CICMOD	(0x7u<<4)
#define	MDF_DFLT5CICR_CICMOD_0	(0x1u<<4)
#define	MDF_DFLT5CICR_DATSRC	(0x3u<<0)
#define	MDF_DFLT5CICR_DATSRC_0	(0x1u<<0)

// DFLT5RSFR Configuration

#define	MDF_DFLT5RSFR_HPFC		(0x3u<<8)
#define	MDF_DFLT5RSFR_HPFC_0	(0x1u<<8)
#define	MDF_DFLT5RSFR_HPFBYP	(0x1u<<7)
#define	MDF_DFLT5RSFR_RSFLTD	(0x1u<<4)
#define	MDF_DFLT5RSFR_RSFLTBYP	(0x1u<<0)

// DFLT5INTR Configuration

#define	MDF_DFLT5INTR_INTVAL	(0x7Fu<<4)
#define	MDF_DFLT5INTR_INTVAL_0	(0x1u<<4)
#define	MDF_DFLT5INTR_INTDIV	(0x3u<<0)
#define	MDF_DFLT5INTR_INTDIV_0	(0x1u<<0)

// OLD5CR Configuration

#define	MDF_OLD5CR_OLDACTIVE	(0x1u<<31)
#define	MDF_OLD5CR_ACICD		(0x1Fu<<17)
#define	MDF_OLD5CR_ACICD_0		(0x1u<<17)
#define	MDF_OLD5CR_ACICN		(0x3u<<12)
#define	MDF_OLD5CR_ACICN_0		(0x1u<<12)
#define	MDF_OLD5CR_BKOLD		(0xFu<<4)
#define	MDF_OLD5CR_BKOLD_0		(0x1u<<4)
#define	MDF_OLD5CR_THINB		(0x1u<<1)
#define	MDF_OLD5CR_OLDEN		(0x1u<<0)

// OLD5THLR Configuration

#define	MDF_OLD5THLR_OLDTHL		(0x3FFFFFFu<<0)
#define	MDF_OLD5THLR_OLDTHL_0	(0x1u<<0)

// OLD5THHR Configuration

#define	MDF_OLD5THHR_OLDTHH		(0x3FFFFFFu<<0)
#define	MDF_OLD5THHR_OLDTHH_0	(0x1u<<0)

// DLY5CR Configuration

#define	MDF_DLY5CR_SKPBF		(0x1u<<31)
#define	MDF_DLY5CR_SKPDLY		(0x7Fu<<0)
#define	MDF_DLY5CR_SKPDLY_0		(0x1u<<0)

// SCD5CR Configuration

#define	MDF_SCD5CR_SCDACTIVE	(0x1u<<31)
#define	MDF_SCD5CR_SCDT			(0xFFu<<12)
#define	MDF_SCD5CR_SCDT_0		(0x1u<<12)
#define	MDF_SCD5CR_BKSCD		(0xFu<<4)
#define	MDF_SCD5CR_BKSCD_0		(0x1u<<4)
#define	MDF_SCD5CR_SCDEN		(0x1u<<0)

// DFLT5IER Configuration

#define	MDF_DFLT5IER_RFOVRIE	(0x1u<<11)
#define	MDF_DFLT5IER_CKABIE		(0x1u<<10)
#define	MDF_DFLT5IER_SATIE		(0x1u<<9)
#define	MDF_DFLT5IER_SCDIE		(0x1u<<8)
#define	MDF_DFLT5IER_SSOVRIE	(0x1u<<7)
#define	MDF_DFLT5IER_OLDIE		(0x1u<<4)
#define	MDF_DFLT5IER_SSDRIE		(0x1u<<2)
#define	MDF_DFLT5IER_DOVRIE		(0x1u<<1)
#define	MDF_DFLT5IER_FTHIE		(0x1u<<0)

// DFLT5ISR Configuration

#define	MDF_DFLT5ISR_RFOVRF		(0x1u<<11)
#define	MDF_DFLT5ISR_CKABF		(0x1u<<10)
#define	MDF_DFLT5ISR_SATF		(0x1u<<9)
#define	MDF_DFLT5ISR_SCDF		(0x1u<<8)
#define	MDF_DFLT5ISR_SSOVRF		(0x1u<<7)
#define	MDF_DFLT5ISR_THHF		(0x1u<<6)
#define	MDF_DFLT5ISR_THLF		(0x1u<<5)
#define	MDF_DFLT5ISR_OLDF		(0x1u<<4)
#define	MDF_DFLT5ISR_RXNEF		(0x1u<<3)
#define	MDF_DFLT5ISR_SSDRF		(0x1u<<2)
#define	MDF_DFLT5ISR_DOVRF		(0x1u<<1)
#define	MDF_DFLT5ISR_FTHF		(0x1u<<0)

// OEC5CR Configuration

#define	MDF_OEC5CR_OFFSET		(0x3FFFFFFu<<0)
#define	MDF_OEC5CR_OFFSET_0		(0x1u<<0)

// SNPS5DR Configuration

#define	MDF_SNPS5DR_SDR			(0xFFFFu<<16)
#define	MDF_SNPS5DR_SDR_0		(0x1u<<16)
#define	MDF_SNPS5DR_EXTSDR		(0x7Fu<<9)
#define	MDF_SNPS5DR_EXTSDR_0	(0x1u<<9)
#define	MDF_SNPS5DR_MCICDC		(0x1FFu<<0)
#define	MDF_SNPS5DR_MCICDC_0	(0x1u<<0)

// DFLT5DR Configuration

#define	MDF_DFLT5DR_DR			(0xFFFFFFu<<8)
#define	MDF_DFLT5DR_DR_0		(0x1u<<8)
